
-- Създаване на базата данни
CREATE DATABASE School;
USE School;

-- Таблица: Ученици
CREATE TABLE Student (
    student_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    date_of_birth DATE,
    address VARCHAR(255),
    phone_number VARCHAR(20),
    email VARCHAR(100),
    grade_level INT
);

-- Таблица: Учители
CREATE TABLE Teacher (
    teacher_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    subject VARCHAR(100),
    phone_number VARCHAR(20),
    email VARCHAR(100),
    employment_date DATE
);

-- Таблица: Предмети
CREATE TABLE Subjects (
    subject_id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    description TEXT
);

-- Таблица: Класове
CREATE TABLE Class (
    class_id INT AUTO_INCREMENT PRIMARY KEY,
    teacher_id INT,
    subject_id INT,
    class_name VARCHAR(100),
    start_time TIME,
    end_time TIME,
    classroom VARCHAR(100),
    FOREIGN KEY (teacher_id) REFERENCES Teacher(teacher_id),
    FOREIGN KEY (subject_id) REFERENCES Subjects(subject_id)
);

-- Таблица: Оценки
CREATE TABLE Grade (
    grade_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    class_id INT,
    grade FLOAT,
    date DATE,
    comments TEXT,
    FOREIGN KEY (student_id) REFERENCES  Student (student_id),
    FOREIGN KEY (class_id) REFERENCES Class (class_id)
);

-- Таблица: Присъствия
CREATE TABLE  Attendance (
    attendance_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    class_id INT,
    date DATE,
    status ENUM('Присъствал', 'Отсъствал'),
    FOREIGN KEY (student_id) REFERENCES Student (student_id),
    FOREIGN KEY (class_id) REFERENCES Class (class_id)
);

-- Таблица: Разписание
CREATE TABLE Schedule (
    schedule_id INT AUTO_INCREMENT PRIMARY KEY,
    class_id INT,
    day_of_week ENUM('Понеделник', 'Вторник', 'Сряда', 'Четвъртък', 'Петък'),
    start_time TIME,
    end_time TIME,
    FOREIGN KEY (class_id) REFERENCES Class(class_id)
);

-- Таблица: Родители
CREATE TABLE Parent (
    parent_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    phone_number VARCHAR(20),
    email VARCHAR(100),
    student_id INT,
    FOREIGN KEY (student_id) REFERENCES Student (student_id)
);

-- Таблица: Извънкласни дейности
CREATE TABLE  Activity (
    activity_id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    description TEXT,
    teacher_id INT,
    start_time TIME,
    end_time TIME,
    FOREIGN KEY (teacher_id) REFERENCES Teacher(teacher_id)
);

-- Таблица: Дисциплинарни действия
CREATE TABLE  DisciplinaryAction (
    disciplinary_action_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    action_type VARCHAR(100),
    description TEXT,
    date DATE,
    teacher_id INT,
    FOREIGN KEY (student_id) REFERENCES Student(student_id),
    FOREIGN KEY (teacher_id) REFERENCES Teacher(teacher_id)
);

-- Таблица: Награди
CREATE TABLE Award (
    award_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    award_name VARCHAR(100),
    description TEXT,
    date DATE,
    FOREIGN KEY (student_id) REFERENCES Student(student_id)
);

-- Таблица: Училищни събития
CREATE TABLE Event (
    event_id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    description TEXT,
    date DATE,
    location VARCHAR(100)
);

-- Таблица: Библиотечни книги
CREATE TABLE   Book (
    book_id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(255),
    author VARCHAR(100),
    isbn VARCHAR(20),
    year_published INT,
    status ENUM('Налична', 'В заем')
);

-- Таблица: Заеми на книги
CREATE TABLE Loan (
    loan_id INT AUTO_INCREMENT PRIMARY KEY,
    book_id INT,
    student_id INT,
    loan_date DATE,
    return_date DATE,
    due_date DATE,
    FOREIGN KEY (book_id) REFERENCES Book (book_id),
    FOREIGN KEY (student_id) REFERENCES Student(student_id)
);

-- Таблица: Шкафчета
CREATE TABLE Locker (
    locker_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    locker_number VARCHAR(10),
    location VARCHAR(100),
    assigned_date DATE,
    return_date DATE,
    FOREIGN KEY (student_id) REFERENCES Student (student_id)
);

-- Тестови данни за Ученици
use School;
INSERT INTO Student (first_name, last_name, date_of_birth, address, phone_number, email, grade_level)
VALUES
('Иван', 'Иванов', '2008-05-12', 'София, ул. Славейков 1', '0881234567', 'ivan.ivanov@example.com', 5),
('Мария', 'Георгиева', '2007-04-23', 'София, бул. България 10', '0882345678', 'maria.georgieva@example.com', 6),
('Петър', 'Димитров', '2006-03-15', 'Пловдив, ул. Ботев 2', '0883456789', 'petar.dimitrov@example.com', 7),
('Даниела', 'Тодорова', '2008-02-28', 'Варна, ул. Левски 3', '0884567890', 'daniela.todorova@example.com', 5),
('Александър', 'Николов', '2009-01-10', 'Бургас, ул. Христо Ботев 4', '0885678901', 'alexandar.nikolov@example.com', 4),
('Елена', 'Симеонова', '2008-11-21', 'Стара Загора, бул. Славянски 5', '0886789012', 'elena.simeonova@example.com', 5),
('Георги', 'Петров', '2007-09-30', 'Русе, ул. Търговска 6', '0887890123', 'georgi.petrov@example.com', 6),
('Кристина', 'Костова', '2006-12-15', 'Плевен, ул. Патриарх Евтимий 7', '0888901234', 'kristina.kostova@example.com', 7),
('Стефан', 'Миланов', '2009-05-05', 'Хасково, ул. Княз Александър 8', '0889012345', 'stefan.milanov@example.com', 4),
('Николай', 'Димов', '2008-07-07', 'Сливен, ул. Витоша 9', '0880123456', 'nikolay.dimov@example.com', 5),
('Николай', 'Колев', '2008-03-10', 'София, ул. Дружба 15', '0881112233', 'nikolai.kolev@example.com', 5),
('Ралица', 'Стоянова', '2009-04-12', 'Пловдив, ул. Слънчева 22', '0882223344', 'ralitsa.stoyanova@example.com', 6),
('Димитър', 'Ангелов', '2007-01-21', 'Варна, бул. Симеон 30', '0883334455', 'dimitar.angelev@example.com', 7),
('София', 'Димитрова', '2008-11-02', 'Русе, ул. Нова 5', '0884445566', 'sofia.dimitrova@example.com', 8),
('Тодор', 'Тодоров', '2009-07-15', 'Бургас, ул. Младост 3', '0885556677', 'todor.todorov@example.com', 6);

-- Тестови данни за Учители
INSERT INTO Teacher (first_name, last_name, subject, phone_number, email, employment_date)
VALUES
('Мария', 'Кирова', 'Математика', '0882345678', 'maria.kirova@example.com', '2020-09-01'),
('Димитър', 'Петров', 'Български език', '0883456789', 'dimitar.petrov@example.com', '2018-08-15'),
('Елена', 'Георгиева', 'История', '0884567890', 'elena.georgieva@example.com', '2019-11-20'),
('Светослав', 'Иванов', 'Физика', '0885678901', 'svetoslav.ivanov@example.com', '2021-02-15'),
('Надежда', 'Станчева', 'Химия', '0886789012', 'nadejda.stancheva@example.com', '2022-01-10'),
('Антоанета', 'Дочева', 'Изкуства', '0887890123', 'antoaneta.docheva@example.com', '2023-04-30'),
('Георги', 'Симеонов', 'Философия', '0888901234', 'georgi.simeonov@example.com', '2022-12-01'),
('Петя', 'Тодорова', 'География', '0889012345', 'petya.todorova@example.com', '2020-09-01'),
('Росен', 'Димитров', 'Компютърни науки', '0880123456', 'rosen.dimitrov@example.com', '2021-03-15'),
('Лиляна', 'Горанова', 'Спорт', '0881234567', 'lilyana.goranova@example.com', '2020-08-20'),
('Петър', 'Стефанов', 'Физика', '0886667788', 'petar.stefanov@example.com', '2018-08-15'),
('Лилия', 'Георгиева', 'Биология', '0887778899', 'liliya.georgieva@example.com', '2019-09-01'),
('Мартин', 'Михайлов', 'История', '0888889900', 'martin.mihailov@example.com', '2020-01-20'),
('Габриела', 'Павлова', 'Химия', '0889990011', 'gabriela.pavlova@example.com', '2017-03-05'),
('Светослав', 'Димитров', 'Информатика', '0880001122', 'svetoslav.dimitrov@example.com', '2021-04-12');

-- Тестови данни за Предмети
INSERT INTO Subjects (name, description)
VALUES
('Математика', 'Изучаване на основни математически концепции и методи.'),
('Български език', 'Изучаване на българския език и литература.'),
('История', 'Изучаване на историята на България и света.'),
('Физика', 'Изучаване на физичните закони и явления.'),
('Химия', 'Изучаване на химичните процеси и вещества.'),
('Изкуства', 'Развитие на творчески умения и знания в изкуствата.'),
('География', 'Изучаване на земята, природата и хората.'),
('Компютърни науки', 'Основи на компютърните технологии и програмирането.'),
('Спорт', 'Физическа активност и спортни умения.'),
('Философия', 'Изучаване на основни философски концепции и мислители.'),
('Физическо възпитание', 'Предмет, който изучава физическата активност и спорта.'),
('Изобразително изкуство', 'Предмет, който развива художествените умения на учениците.'),
('Музика', 'Изучаване на различни музикални стилове и инструменти.'),
('География', 'Изучаване на географските особености и картография.'),
('Литература', 'Изучаване на класически и съвременни литературни произведения.');


-- Тестови данни за Класове
INSERT INTO Class (teacher_id, subject_id, class_name, start_time, end_time, classroom)
VALUES
(1, 1, '5А', '08:00:00', '09:30:00', 'Аудитория 1'),
(2, 2, '6Б', '10:00:00', '11:30:00', 'Аудитория 2'),
(3, 3, '7В', '12:00:00', '13:30:00', 'Аудитория 3'),
(4, 4, '5Г', '14:00:00', '15:30:00', 'Аудитория 4'),
(5, 5, '6Д', '16:00:00', '17:30:00', 'Аудитория 5'),
(6, 6, '7Е', '08:30:00', '10:00:00', 'Аудитория 1'),
(7, 7, '5Ж', '09:30:00', '11:00:00', 'Аудитория 2'),
(8, 8, '6З', '10:30:00', '12:00:00', 'Аудитория 3'),
(9, 9, '7И', '11:30:00', '13:00:00', 'Аудитория 4'),
(10, 10, '5Й', '14:30:00', '16:00:00', 'Аудитория 5'),
(1, 1, '5А', '08:00:00', '09:30:00', 'Класна стая 101'),
(2, 2, '6Б', '09:45:00', '11:15:00', 'Класна стая 102'),
(3, 3, '7В', '11:30:00', '13:00:00', 'Класна стая 103'),
(4, 4, '8Г', '13:15:00', '14:45:00', 'Класна стая 104'),
(5, 5, '9Д', '15:00:00', '16:30:00', 'Класна стая 105');


-- Тестови данни за Оценки
INSERT INTO Grade (student_id, class_id, grade, date, comments)
VALUES
(1, 1, 5.50, '2024-05-10', 'Отличен успех.'),
(2, 2, 4.75, '2024-05-11', 'Добър успех.'),
(3, 3, 3.50, '2024-05-12', 'Среден успех.'),
(4, 4, 5.25, '2024-05-13', 'Много добър успех.'),
(5, 5, 4.00, '2024-05-14', 'Добър успех.'),
(6, 6, 5.00, '2024-05-15', 'Отличен успех.'),
(7, 7, 3.25, '2024-05-16', 'Слаб успех.'),
(8, 8, 4.50, '2024-05-17', 'Добър успех.'),
(9, 9, 5.00, '2024-05-18', 'Отличен успех.'),
(10, 10, 4.25, '2024-05-19', 'Добър успех.'),
(6, 1, 6.00, '2024-05-15', 'Отлично представяне.'),
(7, 2, 5.50, '2024-05-16', 'Добро участие.'),
(8, 3, 4.00, '2024-05-17', 'Средно представяне.'),
(9, 4, 3.50, '2024-05-18', 'Необходимо е повече усилие.'),
(10, 5, 5.00, '2024-05-19', 'Добро представяне.');


-- Тестови данни за Присъствия
INSERT INTO Attendance (student_id, class_id, date, status)
VALUES
(1, 1, '2024-05-10', 'Присъствал'),
(2, 2, '2024-05-11', 'Отсъствал'),
(3, 3, '2024-05-12', 'Присъствал'),
(4, 4, '2024-05-13', 'Присъствал'),
(5, 5, '2024-05-14', 'Отсъствал'),
(6, 6, '2024-05-15', 'Присъствал'),
(7, 7, '2024-05-16', 'Присъствал'),
(8, 8, '2024-05-17', 'Отсъствал'),
(9, 9, '2024-05-18', 'Присъствал'),
(10, 10, '2024-05-19', 'Присъствал'),
(6, 1, '2024-05-20', 'Присъствал'),
(7, 2, '2024-05-21', 'Отсъствал'),
(8, 3, '2024-05-22', 'Присъствал'),
(9, 4, '2024-05-23', 'Присъствал'),
(10, 5, '2024-05-24', 'Отсъствал');


-- Тестови данни за Разписание
INSERT INTO Schedule (class_id, day_of_week, start_time, end_time)
VALUES
(1, 'Понеделник', '08:00:00', '09:30:00'),
(1, 'Вторник', '10:00:00', '11:30:00'),
(2, 'Сряда', '12:00:00', '13:30:00'),
(3, 'Четвъртък', '14:00:00', '15:30:00'),
(4, 'Петък', '16:00:00', '17:30:00'),
(5, 'Понеделник', '08:30:00', '10:00:00'),
(6, 'Вторник', '09:30:00', '11:00:00'),
(7, 'Сряда', '10:30:00', '12:00:00'),
(8, 'Четвъртък', '11:30:00', '13:00:00'),
(9, 'Петък', '14:30:00', '16:00:00'),
(3, 'Понеделник', '12:00:00', '13:30:00'),
(4, 'Вторник', '14:00:00', '15:30:00'),
(5, 'Сряда', '16:00:00', '17:30:00');


-- Тестови данни за Родители
INSERT INTO Parent (first_name, last_name, phone_number, email, student_id)
VALUES
('Иванка', 'Иванова', '0881234567', 'ivanka.ivanova@example.com', 1),
('Георги', 'Георгиев', '0882345678', 'georgi.georgiev@example.com', 2),
('Мирослава', 'Димитрова', '0883456789', 'miroslava.dimitrova@example.com', 3),
('Стефан', 'Стефанов', '0884567890', 'stefan.stefanov@example.com', 4),
('Елена', 'Петрова', '0885678901', 'elena.petrova@example.com', 5),
('Васил', 'Костов', '0886789012', 'vasil.kostov@example.com', 6),
('Анна', 'Николова', '0887890123', 'anna.nikolova@example.com', 7),
('Даниел', 'Тодоров', '0888901234', 'daniel.todorov@example.com', 8),
('Петя', 'Димова', '0889012345', 'petya.dimova@example.com', 9),
('Мариета', 'Николова', '0880123456', 'marieta.nikolova@example.com', 10),
('Калина', 'Иванова', '0881234568', 'kalina.ivanova@example.com', 6),
('Тихомир', 'Тодоров', '0882345679', 'tihomir.todorov@example.com', 7),
('Илка', 'Георгиева', '0883456780', 'ilka.georgieva@example.com', 8),
('Александър', 'Димитров', '0884567891', 'aleksandar.dimitrov@example.com', 9),
('Нина', 'Петрова', '0885678902', 'nina.petrova@example.com', 10);


-- Тестови данни за Извънкласни дейности
INSERT INTO Activity (name, description, teacher_id, start_time, end_time)
VALUES
('Спортен клуб', 'Изучаване на различни спортове и игри.', 10, '15:00:00', '16:30:00'),
('Творчески клуб', 'Развитие на художествени умения.', 6, '14:00:00', '15:30:00'),
('Научен клуб', 'Експерименти и проучвания в различни научни области.', 4, '13:00:00', '14:30:00'),
('Музикален клуб', 'Уроци по музика и свирене на инструменти.', 5, '16:30:00', '18:00:00'),
('Дебатен клуб', 'Развитие на ораторски умения и аргументация.', 2, '17:00:00', '18:30:00'),
('Театрален клуб', 'Развитие на актьорски умения.', 3, '17:00:00', '18:30:00'),
('Шахматен клуб', 'Уроци по шах и стратегия.', 4, '16:00:00', '17:30:00'),
('Компютърен клуб', 'Изучаване на програмиране и технологии.', 2, '15:00:00', '16:30:00'),
('Клуб по литература', 'Обсъждане на книги и автори.', 5, '14:00:00', '15:30:00'),
('Клуб по фотография', 'Развитие на фотографски умения.', 1, '13:00:00', '14:30:00');


-- Тестови данни за Дисциплинарни действия
INSERT INTO DisciplinaryAction (student_id, action_type, description, date, teacher_id)
VALUES
(1, 'Забележка', 'Неправилно поведение в час.', '2024-05-01', 2),
(2, 'Наказание', 'Отсъствие без разрешение.', '2024-05-02', 3),
(3, 'Забележка', 'Късно пристигане на училище.', '2024-05-03', 4),
(4, 'Забележка', 'Използване на мобилен телефон в час.', '2024-05-04', 5),
(5, 'Наказание', 'Неправилно поведение по време на извънкласно мероприятие.', '2024-05-05', 6),
(6, 'Забележка', 'Неправилно поведение по време на час.', '2024-05-10', 1),
(7, 'Наказание', 'Отсъствие без разрешение.', '2024-05-11', 2),
(8, 'Забележка', 'Късно пристигане на училище.', '2024-05-12', 3),
(9, 'Наказание', 'Неуважение към учител.', '2024-05-13', 4),
(10, 'Забележка', 'Разговори по време на час.', '2024-05-14', 5);


-- Тестови данни за Награди
INSERT INTO Award (student_id, award_name, description, date)
VALUES
(1, 'Златен медал', 'Първо място на математическо състезание.', '2024-05-15'),
(2, 'Сребърен медал', 'Второ място на конкурс по литература.', '2024-05-16'),
(3, 'Трето място', 'Трето място на спортни игри.', '2024-05-17'),
(4, 'Диплом за участие', 'Участие в художествен конкурс.', '2024-05-18'),
(5, 'Почетна награда', 'Награда за отлично представяне.', '2024-05-19'),
(6, 'Златен медал', 'Награда за отлично представяне в олимпиада.', '2024-06-01'),
(7, 'Сребърен медал', 'Награда за второ място в състезание по математика.', '2024-06-02'),
(8, 'Похвала', 'За активно участие в клас.', '2024-06-03'),
(9, 'Награда за творчество', 'Награда за иновативен проект.', '2024-06-04'),
(10, 'Диплом за честност', 'Награда за честно поведение.', '2024-06-05');

-- Тестови данни за Училищни събития
INSERT INTO Event (name, description, date, location)
VALUES
('Ден на отворените врати', 'Събитие за родители и ученици.', '2024-06-01', 'Училищен двор'),
('Спортен ден', 'Ден на спорта с различни атракции.', '2024-06-10', 'Спортен комплекс'),
('Творчески фестивал', 'Фестивал на изкуствата и талантите.', '2024-06-20', 'Аудитория 1'),
('Научен панаир', 'Презентации на учениците по научни проекти.', '2024-06-30', 'Училищен двор'),
('Завършване на учебната година', 'Церемония по случай завършването.', '2024-07-05', 'Аудитория 1'),
('Ден на отворените врати', 'Събитие за родителите и учениците.', '2024-06-10', 'Училищен двор'),
('Фестивал на изкуствата', 'Изложба на ученици.', '2024-06-15', 'Учебен театър'),
('Спортен ден', 'Ден на спортни активности.', '2024-06-20', 'Спортна площадка'),
('Книжно изложение', 'Изложение на нови книги и автори.', '2024-06-25', 'Библиотека'),
('Театрална постановка', 'Представление на театралния клуб.', '2024-06-30', 'Учебен театър');


-- Тестови данни за Библиотечни книги
INSERT INTO Book (title, author, isbn, year_published, status)
VALUES
('Война и мир', 'Лев Толстой', '978-619-148-445-8', 1869, 'Налична'),
('1984', 'Джордж Оруел', '978-619-148-445-9', 1949, 'Налична'),
('Граф Монте Кристо', 'Александър Дюма', '978-619-148-446-0', 1844, 'В заем'),
('Малкият принц', 'Антоан дьо Сент-Екзюпери', '978-619-148-446-1', 1943, 'Налична'),
('Приключенията на Хъкълбери Фин', 'Марк Твен', '978-619-148-446-2', 1884, 'Налична'),
('Малкият принц', 'Антоан дьо Сент-Екзюпери', '978-3-16-148410-0', 1943, 'Налична'),
('1984', 'Джордж Оруел', '978-0-452-28423-4', 1949, 'Налична'),
('Войната на световете', 'Хърбърт Уелс', '978-0-14-303097-3', 1898, 'В заем'),
('Гордост и предразсъдъци', 'Джейн Остин', '978-0-19-953556-9', 1813, 'Налична'),
('Тримата мускетари', 'Александър Дюма', '978-0-14-303635-7', 1844, 'В заем');

-- Тестови данни за Заеми на книги
INSERT INTO Loan (book_id, student_id, loan_date, return_date, due_date)
VALUES
(1, 1, '2024-06-01', '2024-06-15', '2024-06-10'),
(2, 2, '2024-06-05', '2024-06-20', '2024-06-15'),
(3, 3, '2024-06-10', NULL, '2024-06-20'),
(4, 4, '2024-06-15', NULL, '2024-06-25'),
(5, 5, '2024-06-20', '2024-06-30', '2024-06-28'),
(1, 6, '2024-05-15', NULL, '2024-06-15'),
(2, 7, '2024-05-16', '2024-06-01', '2024-06-10'),
(3, 8, '2024-05-17', NULL, '2024-06-17'),
(4, 9, '2024-05-18', '2024-06-05', '2024-06-10'),
(5, 10, '2024-05-19', NULL, '2024-06-20');

-- Тестови данни за Сейфове
INSERT INTO Locker (student_id, locker_number, location, assigned_date, return_date)
VALUES
(1, 'L001', 'Коридор 1', '2024-05-01', NULL),
(2, 'L002', 'Коридор 2', '2024-05-02', '2024-06-10'),
(3, 'L003', 'Коридор 3', '2024-05-03', NULL),
(4, 'L004', 'Коридор 4', '2024-05-04', '2024-06-15'),
(5, 'L005', 'Коридор 5', '2024-05-05', NULL),
(6, 'L006', 'Коридор 1', '2024-05-01', NULL),
(7, 'L007', 'Коридор 2', '2024-05-02', '2024-06-10'),
(8, 'L008', 'Коридор 3', '2024-05-03', NULL),
(9, 'L009', 'Коридор 4', '2024-05-04', '2024-06-15'),
(10, 'L010', 'Коридор 5', '2024-05-05', NULL);